avr-rust/avrd/packs/xmegaa/ATxmega64A4U.atdf
      <value-group caption="Gain factor" name="ADC_CH_GAIN">
        <value caption="1x gain" name="1X" value="0x00"/>
        <value caption="2x gain" name="2X" value="0x01"/>
        <value caption="4x gain" name="4X" value="0x02"/>
        <value caption="8x gain" name="8X" value="0x03"/>
        <value caption="16x gain" name="16X" value="0x04"/>
        <value caption="32x gain" name="32X" value="0x05"/>
        <value caption="64x gain" name="64X" value="0x06"/>
        <value caption="x/2 gain" name="DIV2" value="0x07"/>
      </value-group>
      <value-group caption="Conversion result resolution" name="ADC_RESOLUTION">
        <value caption="12-bit right-adjusted result" name="12BIT" value="0x00"/>
        <value caption="8-bit right-adjusted result" name="8BIT" value="0x02"/>
        <value caption="12-bit left-adjusted result" name="LEFT12BIT" value="0x03"/>
      </value-group>
      <value-group caption="Current Limitation Mode" name="ADC_CURRLIMIT">
        <value caption="No limit" name="NO" value="0x00"/>
        <value caption="Low current limit, max. sampling rate 1.5MSPS" name="LOW" value="0x01"/>
        <value caption="Medium current limit, max. sampling rate 1MSPS" name="MED" value="0x02"/>
        <value caption="High current limit, max. sampling rate 0.5MSPS" name="HIGH" value="0x03"/>
      </value-group>
      <value-group caption="Voltage reference selection" name="ADC_REFSEL">
        <value caption="Internal 1V" name="INT1V" value="0x00"/>
        <value caption="Internal VCC / 1.6" name="INTVCC" value="0x01"/>
        <value caption="External reference on PORT A" name="AREFA" value="0x02"/>
        <value caption="External reference on PORT B" name="AREFB" value="0x03"/>
        <value caption="Internal VCC / 2" name="INTVCC2" value="0x04"/>
      </value-group>
      <value-group caption="Channel sweep selection" name="ADC_SWEEP">
        <value caption="ADC Channel 0" name="0" value="0x00"/>
        <value caption="ADC Channel 0,1" name="01" value="0x01"/>
        <value caption="ADC Channel 0,1,2" name="012" value="0x02"/>
        <value caption="ADC Channel 0,1,2,3" name="0123" value="0x03"/>
      </value-group>
      <value-group caption="Event channel input selection" name="ADC_EVSEL">
        <value caption="Event Channel 0,1,2,3" name="0123" value="0x00"/>
        <value caption="Event Channel 1,2,3,4" name="1234" value="0x01"/>
        <value caption="Event Channel 2,3,4,5" name="2345" value="0x02"/>
        <value caption="Event Channel 3,4,5,6" name="3456" value="0x03"/>
        <value caption="Event Channel 4,5,6,7" name="4567" value="0x04"/>
        <value caption="Event Channel 5,6,7" name="567" value="0x05"/>
        <value caption="Event Channel 6,7" name="67" value="0x06"/>
        <value caption="Event Channel 7" name="7" value="0x07"/>
      </value-group>
      <value-group caption="Event action selection" name="ADC_EVACT">
        <value caption="No event action" name="NONE" value="0x00"/>
        <value caption="First event triggers channel 0" name="CH0" value="0x01"/>
        <value caption="First two events trigger channel 0,1" name="CH01" value="0x02"/>
        <value caption="First three events trigger channel 0,1,2" name="CH012" value="0x03"/>
        <value caption="Events trigger channel 0,1,2,3" name="CH0123" value="0x04"/>
        <value caption="First event triggers sweep" name="SWEEP" value="0x05"/>
        <value caption="The ADC is flushed and restarted for accurate timing" name="SYNCSWEEP" value="0x06"/>
      </value-group>
      <value-group caption="Interupt mode" name="ADC_CH_INTMODE">
        <value caption="Interrupt on conversion complete" name="COMPLETE" value="0x00"/>
        <value caption="Interrupt on result below compare value" name="BELOW" value="0x01"/>
        <value caption="Interrupt on result above compare value" name="ABOVE" value="0x03"/>
      </value-group>
      <value-group caption="Interrupt level" name="ADC_CH_INTLVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low level" name="LO" value="0x01"/>
        <value caption="Medium level" name="MED" value="0x02"/>
        <value caption="High level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="DMA request selection" name="ADC_DMASEL">
        <value caption="Combined DMA request OFF" name="OFF" value="0x00"/>
        <value caption="ADC Channel 0 or 1" name="CH01" value="0x01"/>
        <value caption="ADC Channel 0 or 1 or 2" name="CH012" value="0x02"/>
        <value caption="ADC Channel 0 or 1 or 2 or 3" name="CH0123" value="0x03"/>
      </value-group>
      <value-group caption="Clock prescaler" name="ADC_PRESCALER">
        <value caption="Divide clock by 4" name="DIV4" value="0x00"/>
        <value caption="Divide clock by 8" name="DIV8" value="0x01"/>
        <value caption="Divide clock by 16" name="DIV16" value="0x02"/>
        <value caption="Divide clock by 32" name="DIV32" value="0x03"/>
        <value caption="Divide clock by 64" name="DIV64" value="0x04"/>
        <value caption="Divide clock by 128" name="DIV128" value="0x05"/>
        <value caption="Divide clock by 256" name="DIV256" value="0x06"/>
        <value caption="Divide clock by 512" name="DIV512" value="0x07"/>
      </value-group>
      <interrupt-group name="ADC">
        <interrupt index="0" name="CH0" caption="Interrupt 0"/>
        <interrupt index="1" name="CH1" caption="Interrupt 1"/>
        <interrupt index="2" name="CH2" caption="Interrupt 2"/>
        <interrupt index="3" name="CH3" caption="Interrupt 3"/>
      </interrupt-group>
    </module>
    <module name="DAC" id="I6059" version="XMEGAAU" caption="Digital/Analog Converter">
      <register-group caption="Digital-to-Analog Converter" name="DAC" size="28">
        <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="Internal Output Enable" mask="0x10" name="IDOEN"/>
          <bitfield caption="Channel 1 Output Enable" mask="0x08" name="CH1EN"/>
          <bitfield caption="Channel 0 Output Enable" mask="0x04" name="CH0EN"/>
          <bitfield caption="Low Power Mode" mask="0x02" name="LPMODE"/>
          <bitfield caption="Enable" mask="0x01" name="ENABLE"/>
        </register>
        <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
          <bitfield caption="Channel Select" mask="0x60" name="CHSEL" values="DAC_CHSEL"/>
          <bitfield caption="Channel 1 Event Trig Enable" mask="0x02" name="CH1TRIG"/>
          <bitfield caption="Channel 0 Event Trig Enable" mask="0x01" name="CH0TRIG"/>
        </register>
